<h1>операции</h1>
<h2>арифметические операции</h2>
<p>+ - * / ** %</p>
<p>инкремент и декремент</p>
<?php
$i=5;
echo --$i;
?>
<h2>операция со строками - конкатенация</h2>
<?php
$str1="Hello, ";
$str2='world';
echo $str1 . 55;
echo " ", $str1 . $str2 . true;
?>
<h2>операция сравнения</h2>
<p> < > == != <= >= </p>
<?php
$a=(5==5);
echo $a;
?>
<h2>операции строгого сравнения</h2>
<p>=== !==</p>
<?php
$b=(5=='5');
$c=(5==='5');
echo "b=$b, c=$c";
?>
<h2>логические операции</h2>
<p>И (&& или and) ИЛИ (|| или or) НЕ (!)</p>
<?php
$x=(true && false);
$y=(true || false);
?>
<h2>операции присваивания</h2>
<p>=</p>
<?php
$d='hello';
$e=5;
$e+=7;
$f=3;
$f*=$e;
?>
<p>= += -= *= /= **= .= %=</p>
<h2>приоритет операций</h2>
<p>** (++ --) ! (* / %) (+ - .) (< > <= >=) (== != === !==) && || (= += ...)</p>