<h2>Задача 1</h2>
<?php
$a=14;
$b=12;
echo "a = " . $a . "<br>b = " . $b;
$res = $a < $b ? 'a меньше b - ' . $a+$b : 'a больше или равно b - ' . $a*$b;
echo "<br>Результат: " . $res;
?>
<h2>Задача 2</h2>
<form>
    <p>Введите число:</p>
    <input name="number">
    <input type="submit">
</form>
<?php
if(isset($_GET['number'])){
    $n = $_GET['number'];
    echo "исходное число - $n<br>";
    echo ($n%2 === 0) ? 'четное' : 'нечетное';
}
?>
<h2>Задача 3</h2>
<form>
    <p>Введите число:</p>
    <input name="numb">
    <input type="submit">
</form>
<?php
if(isset($_GET['numb'])){
    $sum = $_GET['numb'];
    echo "Исходная сумма - $sum<br>";
    echo ($sum > 1000) ? 'Сумма более 1000, скидка 10%: ' . ($sum*0.90) : 'Сумма меньше или равна 1000, скидка 5%: ' . ($sum*0.95);
}
?>
<h2>Задача 4</h2>
<?php
$a=1;
$b=2;
$c=2;
echo "Стороны треугольника: a=$a, b=$b, c=$c. ";
echo ($a+$b > $c)
        ? (($a+$c > $b)
            ?(($b+$c > $a) ? "Треугольник существует" : "Треугольника не существует")
            : "Треугольника не существует")
        : "Треугольника не существует";
?>
<h2>Задача 5</h2>
<?php
$age = 9;
echo "Возраст котов/кошек: $age";
$ageGroup=($age <= 1) ? '<br>Котята'
        : (($age <= 3) ? '<br>Молодые коты'
        : (($age <= 7) ? '<br>Коты средних лет'
        : '<br>Почтенные коты'));
echo $ageGroup;
?>
<h2>Задача 6</h2>
