<h2>задача первая:</h2>
<?php //первая задача
$a=25;
$b=15;
echo "имеем два числа: a=$a , b=$b";
if($a<$b){
    echo "<br>$a+$b=";
    echo $a+$b;
} else {
    echo "<br>$a*$b=";
    echo $a*$b;
} //конец первой задачи
?>
<h2>задача вторая:</h2>
<?php //вторая задача
$b=89;
$c=90;
echo "имеем два угла: b=$b , c=$c";
if(0<$b && $b<180 && 0<$c && $c<180 && $b+$c<180){
    echo '<br>такой треугольник существует';
    if($b=90 or $c=90){
    echo '<br>такой треугольник прямоугольный';
    }
} else{
    echo"<br>треугольник с такими значениями не существует";
} //конец второй задачи
?>
<h2>задача третья:</h2>
<?php //третья задача
$age=6;
echo "возраст кота/кошки: $age";
if ($age<=1){
    echo'<br>это котята';
} elseif($age>1 && $age<=3){
    echo'<br>это молодые коты';
} elseif($age>3 && $age<=7){
    echo'<br>это коты средних лет';
} elseif($age>7){
    echo'<br>это почтенные коты';
} //конец третьей задачи
?>
<h2>задача четвертая:</h2>
<?php //четвертая задача
$a=5;
$b=7;
$c=100;
echo "стороны треугольника равны a=$a b=$b c=$c<br>";
if ($a<=0||$b<=0||$c<=0){
    echo " трегольник не существует: все стороны должны иметь положительные значения";
}
elseif (($a+$b>$c)&&($a+$c>$b)&&($b+$c>$a)) {
    echo  "треугольник с такими сторонами существует";
} else {
    echo'такого треугольника не существует';
} //конец четвертой задачи
?>
<h2>задача пятая:</h2>
<?php
$N=2024;
if ($N%4!=0){
    echo"$N-й год не является високосным";
} elseif($N%100==0 && $N%400!=0){
    echo"$N-й год не является високосным";
} else{
    echo"$N-й год является високосным";
}
?>
<h2>задача шестая:</h2>
<?php //начало шестой задачи
$A=216;
$B=129345;
echo"имеем числа: A=$A , B=$B<br>";
if($A+$B>32767){
    echo"суммирование приводит к переполнению";
} else{
    echo"суммирование не приводит к переполнению";
} //конец шестой задачи
?>
<h2>задача седьмая:</h2>
<?php
$A=1;
$B=2;
$x=3;
$y=4;
$z=5;
echo"Размеры прямоугольного отверстия: A=$A , B=$B<br>";
echo"Размеры кирпича: x=$x , y=$y , z=$z<br>";
?>