<h1>Циклы</h1>
<h2>задача 1</h2>
<?php
$startnumber = 5; //стартовое значение
$multiplier = 5; //множитель
$Q = 5; //количество чисел
echo"стартовое число = $startnumber <br> мультипликатор = $multiplier<br>длинна прогрессии: $Q чисел<br> геометрическая прогрессия: ";
for($i = 0; $i < $Q; $i++){ //цикл выполняется $Q раз
    echo $startnumber . " "; //вывод текущего числа на экран
    $startnumber = $startnumber * $multiplier; //умножаем текущее число на множитель для  следующего шага
}
?>
<h2>задача 2</h2>
<?php
$lastnumber = 10; //число, до которого складываем включительно
$sum = 0; //переменная для накопления суммы
echo"число, до которого складываем включительно: " . $lastnumber . "<br>переменная для накопления суммы: " . $sum;
for($i = 1; $i <= $lastnumber; $i++){ //цикл от 1 до $lastnumber включительно
    $sum += $i; //прибавляем текущее число к общей сумме
}
echo "<br>сумма чисел  от 1 до " . $lastnumber . " равна: " . $sum;
?>
<h2>задача 3</h2>
<?php
$lastnumber=10; //число, от которого идет последовательность включительно
$multiplicationResult=1; //переменная для накопления произведения
echo"число, от которого идет последовательность включительно: " . $lastnumber . "<br>переменная для накопления произведения: " . $multiplicationResult;
for($i = 1; $i <= $lastnumber; $i++){ //цикл от 1 до $lastnumber включительно
    if($i % 2 == 0){ //проверка четности
        $multiplicationResult *= $i; //умножаем текущее произведение на чётное число
    }
}
echo"<br>производное четных чисел от 1 до " . $lastnumber . " равно: " . $multiplicationResult;
?>
<h2>задача 4</h2>
<?php
$n=10; //вводное значение
$daily=10; //сколько пробежал в первый день
$total=0; //общее количество
echo"вводное значение: " . $n . "<br>сколько пробежал в первый день: " . $daily . "<br>общее количество изначально: " . $total;
for($day=1; $day<=$n; $day++){
    $total += $daily; //прибавляем дистанцию текущего дня к общей сумме
    $daily = $daily * 1.1; //+10% к норме от предыдущего дня
}
echo"<br>суммарный путь за " . $n . " дней: " . $total . " км";
?>
<h2>задача 5</h2>
<?php
$total=64;
echo"возможные комбинации гусей и кроликов (всего лап: $total):<br>";
?>